### Terraform Plan: `dev`
```
module.platform.data.aws_region.current: Reading...
module.platform.data.aws_caller_identity.current: Reading...
module.platform.module.eks.data.aws_region.current: Reading...
module.platform.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.platform.module.eks.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.platform.data.aws_caller_identity.current: Read complete after 0s [id=936249129410]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.platform.module.app.kubernetes_config_map.app will be created
  + resource "kubernetes_config_map" "app" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "platform-sre-demo-config"
          + namespace        = "demo"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.platform.module.app.kubernetes_deployment.app will be created
  + resource "kubernetes_deployment" "app" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "platform-sre-demo"
            }
          + name             = "platform-sre-demo"
          + namespace        = "demo"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "1"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "platform-sre-demo"
                }
            }

          + template {
              + metadata {
                  + annotations      = {
                      + "prometheus.io/port"   = "80"
                      + "prometheus.io/scrape" = "true"
                    }
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "platform-sre-demo"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                      = "nginx:1.25-alpine"
                      + image_pull_policy          = (known after apply)
                      + name                       = "app"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + env_from {
                          + config_map_ref {
                              + name = "platform-sre-demo-config"
                            }
                        }

                      + liveness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 10
                          + period_seconds        = 10
                          + success_threshold     = 1
                          + timeout_seconds       = 1

                          + http_get {
                              + path   = "/"
                              + port   = "80"
                              + scheme = "HTTP"
                            }
                        }

                      + port {
                          + container_port = 80
                          + name           = "http"
                          + protocol       = "TCP"
                        }

                      + readiness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 5
                          + period_seconds        = 5
                          + success_threshold     = 1
                          + timeout_seconds       = 1

                          + http_get {
                              + path   = "/"
                              + port   = "80"
                              + scheme = "HTTP"
                            }
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "200m"
                              + "memory" = "128Mi"
                            }
                          + requests = {
                              + "cpu"    = "50m"
                              + "memory" = "64Mi"
                            }
                        }

                      + security_context {
                          + allow_privilege_escalation = false
                          + privileged                 = false
                          + read_only_root_filesystem  = false
                          + run_as_non_root            = false
                        }
                    }
                }
            }
        }
    }

  # module.platform.module.app.kubernetes_namespace.app will be created
  + resource "kubernetes_namespace" "app" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"         = "platform-sre-demo"
              + "environment" = "dev"
            }
          + name             = "demo"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.platform.module.app.kubernetes_service.app will be created
  + resource "kubernetes_service" "app" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + annotations      = {
              + "service.beta.kubernetes.io/aws-load-balancer-scheme" = "internet-facing"
              + "service.beta.kubernetes.io/aws-load-balancer-type"   = "nlb"
            }
          + generation       = (known after apply)
          + name             = "platform-sre-demo"
          + namespace        = "demo"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "app" = "platform-sre-demo"
            }
          + session_affinity                  = "None"
          + type                              = "LoadBalancer"

          + port {
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "80"
            }
        }
    }

  # module.platform.module.eks.data.tls_certificate.eks will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "eks" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.platform.module.eks.aws_eks_access_entry.node will be created
  + resource "aws_eks_access_entry" "node" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "platform-sre-demo-dev-eks"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = (known after apply)
      + tags_all          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
        }
      + type              = "EC2_LINUX"
      + user_name         = (known after apply)
    }

  # module.platform.module.eks.aws_eks_addon.coredns will be created
  + resource "aws_eks_addon" "coredns" {
      + addon_name           = "coredns"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "platform-sre-demo-dev-eks"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
    }

  # module.platform.module.eks.aws_eks_addon.kube_proxy will be created
  + resource "aws_eks_addon" "kube_proxy" {
      + addon_name           = "kube-proxy"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "platform-sre-demo-dev-eks"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
    }

  # module.platform.module.eks.aws_eks_addon.vpc_cni will be created
  + resource "aws_eks_addon" "vpc_cni" {
      + addon_name           = "vpc-cni"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "platform-sre-demo-dev-eks"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
    }

  # module.platform.module.eks.aws_eks_cluster.this will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "platform-sre-demo-dev-eks"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all                      = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + version                       = "1.29"

      + access_config {
          + authentication_mode = "API_AND_CONFIG_MAP"
        }

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.platform.module.eks.aws_eks_node_group.default will be created
  + resource "aws_eks_node_group" "default" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "platform-sre-demo-dev-eks"
      + disk_size              = 20
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + labels                 = {
          + "environment" = "dev"
          + "role"        = "general"
        }
      + node_group_name        = "platform-sre-demo-dev-eks-default"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.platform.module.eks.aws_iam_openid_connect_provider.eks will be created
  + resource "aws_iam_openid_connect_provider" "eks" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.platform.module.eks.aws_iam_policy.lb_controller will be created
  + resource "aws_iam_policy" "lb_controller" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "platform-sre-demo-dev-eks-lb-controller"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "iam:CreateServiceLinkedRole",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeCoipPools",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeTrustStores",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "elasticloadbalancing:CreateAction" = [
                                  + "CreateTargetGroup",
                                  + "CreateLoadBalancer",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
    }

  # module.platform.module.eks.aws_iam_role.cluster will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "platform-sre-demo-dev-eks-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + unique_id             = (known after apply)
    }

  # module.platform.module.eks.aws_iam_role.lb_controller will be created
  + resource "aws_iam_role" "lb_controller" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "platform-sre-demo-dev-eks-lb-controller"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + unique_id             = (known after apply)
    }

  # module.platform.module.eks.aws_iam_role.node_group will be created
  + resource "aws_iam_role" "node_group" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "platform-sre-demo-dev-eks-node-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + unique_id             = (known after apply)
    }

  # module.platform.module.eks.aws_iam_role_policy_attachment.cluster_policy will be created
  + resource "aws_iam_role_policy_attachment" "cluster_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "platform-sre-demo-dev-eks-cluster-role"
    }

  # module.platform.module.eks.aws_iam_role_policy_attachment.cluster_vpc_controller will be created
  + resource "aws_iam_role_policy_attachment" "cluster_vpc_controller" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "platform-sre-demo-dev-eks-cluster-role"
    }

  # module.platform.module.eks.aws_iam_role_policy_attachment.lb_controller will be created
  + resource "aws_iam_role_policy_attachment" "lb_controller" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "platform-sre-demo-dev-eks-lb-controller"
    }

  # module.platform.module.eks.aws_iam_role_policy_attachment.node_cni will be created
  + resource "aws_iam_role_policy_attachment" "node_cni" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "platform-sre-demo-dev-eks-node-role"
    }

  # module.platform.module.eks.aws_iam_role_policy_attachment.node_ecr will be created
  + resource "aws_iam_role_policy_attachment" "node_ecr" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "platform-sre-demo-dev-eks-node-role"
    }

  # module.platform.module.eks.aws_iam_role_policy_attachment.node_ssm will be created
  + resource "aws_iam_role_policy_attachment" "node_ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "platform-sre-demo-dev-eks-node-role"
    }

  # module.platform.module.eks.aws_iam_role_policy_attachment.node_worker will be created
  + resource "aws_iam_role_policy_attachment" "node_worker" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "platform-sre-demo-dev-eks-node-role"
    }

  # module.platform.module.eks.aws_kms_alias.eks will be created
  + resource "aws_kms_alias" "eks" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/platform-sre-demo-dev-eks-secrets"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.platform.module.eks.aws_kms_key.eks will be created
  + resource "aws_kms_key" "eks" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for EKS secrets encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
    }

  # module.platform.module.eks.aws_security_group.cluster will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS cluster control plane"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "platform-sre-demo-dev-eks-cluster-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "platform-sre-demo-dev-eks-cluster-sg"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "platform-sre-demo-dev-eks-cluster-sg"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + vpc_id                 = (known after apply)
    }

  # module.platform.module.eks.aws_security_group.node will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "Additional security group for EKS nodes"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "DNS TCP"
              + from_port        = 53
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 53
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "DNS UDP"
              + from_port        = 53
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 53
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS outbound (ECR, API, logging)"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "All traffic within VPC"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "platform-sre-demo-dev-eks-node-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "platform-sre-demo-dev-eks-node-sg"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "platform-sre-demo-dev-eks-node-sg"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + vpc_id                 = (known after apply)
    }

  # module.platform.module.observability.data.aws_cloudwatch_log_group.eks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_cloudwatch_log_group" "eks" {
      + arn               = (known after apply)
      + creation_time     = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/eks/platform-sre-demo-dev-eks/cluster"
      + retention_in_days = (known after apply)
      + tags              = (known after apply)
    }

  # module.platform.module.observability.aws_cloudwatch_metric_alarm.node_cpu_high will be created
  + resource "aws_cloudwatch_metric_alarm" "node_cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "EKS node CPU utilization exceeds 80% for 15 minutes"
      + alarm_name                            = "platform-sre-demo-dev-node-cpu-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "platform-sre-demo-dev-eks"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "node_cpu_utilization"
      + namespace                             = "ContainerInsights"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.platform.module.observability.aws_cloudwatch_metric_alarm.node_memory_high will be created
  + resource "aws_cloudwatch_metric_alarm" "node_memory_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "EKS node memory utilization exceeds 80% for 15 minutes"
      + alarm_name                            = "platform-sre-demo-dev-node-memory-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "platform-sre-demo-dev-eks"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "node_memory_utilization"
      + namespace                             = "ContainerInsights"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.platform.module.observability.aws_cloudwatch_metric_alarm.rds_cpu_high will be created
  + resource "aws_cloudwatch_metric_alarm" "rds_cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "RDS CPU utilization exceeds 80% for 15 minutes"
      + alarm_name                            = "platform-sre-demo-dev-rds-cpu-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "platform-sre-demo-dev-postgres"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.platform.module.observability.aws_cloudwatch_metric_alarm.rds_storage_low will be created
  + resource "aws_cloudwatch_metric_alarm" "rds_storage_low" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "RDS free storage below 2 GiB"
      + alarm_name                            = "platform-sre-demo-dev-rds-storage-low"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "platform-sre-demo-dev-postgres"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "FreeStorageSpace"
      + namespace                             = "AWS/RDS"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + threshold                             = 2147483648
      + treat_missing_data                    = "missing"
    }

  # module.platform.module.observability.aws_kms_key.sns will be created
  + resource "aws_kms_key" "sns" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for SNS topic encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
    }

  # module.platform.module.observability.aws_sns_topic.alerts will be created
  + resource "aws_sns_topic" "alerts" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "platform-sre-demo-dev-alerts"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tracing_config              = (known after apply)
    }

  # module.platform.module.rds.aws_db_instance.this will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 1
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "appdb"
      + db_subnet_group_name                  = "platform-sre-demo-dev-rds"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "16"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = true
      + id                                    = (known after apply)
      + identifier                            = "platform-sre-demo-dev-postgres"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + timezone                              = (known after apply)
      + username                              = "dbadmin"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.platform.module.rds.aws_db_parameter_group.this will be created
  + resource "aws_db_parameter_group" "this" {
      + arn          = (known after apply)
      + description  = "Custom parameter group for platform-sre-demo-dev"
      + family       = "postgres16"
      + id           = (known after apply)
      + name         = (known after apply)
      + name_prefix  = "platform-sre-demo-dev-pg16-"
      + skip_destroy = false
      + tags         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "rds.force_ssl"
          + value        = "1"
        }
    }

  # module.platform.module.rds.aws_db_subnet_group.this will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "platform-sre-demo-dev-rds"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "platform-sre-demo-dev-rds-subnet-group"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + tags_all                = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "platform-sre-demo-dev-rds-subnet-group"
          + "Project"     = "platform-sre-demo"
          + "Repository"  = "sre-assessment"
        }
      + vpc_id                  = (known after apply)
    }

  # module.platform.module.rds.aws_iam_role.rds_monitoring will be created
  + resource "aws_iam_role" "rds_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "platform-sre-demo-dev-rd

... (truncated)
```
*Triggered by @ahalsey in b3a552ae91d7989801ee4f0eac2abd7eac984e56*